### Задание 1
Импортируйте библиотеку Pandas и дайте ей псевдоним pd.  
Создайте датафрейм authors со столбцами author_id и author_name,  
в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].  
Затем создайте датафрейм book cо столбцами author_id, book_title и price,  
в которых соответственно содержатся данные:  [1, 1, 1, 2, 2, 3, 3],  
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],  
[450, 300, 350, 500, 450, 370, 290].

In [2]:
import pandas as pd

In [20]:
authors = pd.DataFrame({'author_id': [1,2,3], 'author_name': ['Тургенев', 'Чехов', 'Островский']}, 
                      columns = ['author_id', 'author_name'])
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [21]:
book = pd.DataFrame({'author_id': [1,1,1,2,2,3,3], 
                     'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                     'price': [450, 300, 350, 500, 450, 370, 290]},
                   columns = ['author_id','book_title','price'])
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

### Задание 2
Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [14]:
 authors_price = pd.merge(authors, book, on = 'author_id', how = 'inner')

In [15]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### Задание 3
Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [16]:
top5 = authors_price.nlargest(5, 'price')

In [17]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

### Задание 4
Создайте датафрейм authors_stat на основе информации из authors_price.  
В датафрейме authors_stat должны быть четыре столбца:  
  author_name  
  min_price  
  max_price  
  mean_price
  
В которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги этого автора.

In [27]:
authors_min_price = authors_price.groupby('author_name').agg({'price': 'min'}).rename(columns={'price':'min_price'}).reset_index()
authors_min_price

  author_name  min_price
0  Островский        290
1    Тургенев        300
2       Чехов        450

In [28]:
authors_max_price = authors_price.groupby('author_name').agg({'price': 'max'}).rename(columns={'price':'max_price'}).reset_index()
authors_max_price

  author_name  max_price
0  Островский        370
1    Тургенев        450
2       Чехов        500

In [29]:
authors_mean_price = authors_price.groupby('author_name').agg({'price': 'mean'}).rename(columns={'price':'mean_price'}).reset_index()
authors_mean_price

  author_name  mean_price
0  Островский  330.000000
1    Тургенев  366.666667
2       Чехов  475.000000

In [33]:
authors_stat_0 = pd.merge(authors_min_price, authors_max_price, on = 'author_name', how = 'inner')
authors_stat_0

  author_name  min_price  max_price
0  Островский        290        370
1    Тургенев        300        450
2       Чехов        450        500

In [34]:
authors_stat = pd.merge(authors_stat_0, authors_mean_price, on = 'author_name', how = 'inner')
authors_stat

  author_name  min_price  max_price  mean_price
0  Островский        290        370  330.000000
1    Тургенев        300        450  366.666667
2       Чехов        450        500  475.000000

In [39]:
authors_stat_one_line_result = authors_price.groupby('author_name')['price'].agg(['min', 'max', 'mean']).reset_index(). \
                               rename(columns={'min':'min_price', 'max': 'max_price', 'mean': 'mean_price'})
authors_stat_one_line_result

  author_name  min_price  max_price  mean_price
0  Островский        290        370  330.000000
1    Тургенев        300        450  366.666667
2       Чехов        450        500  475.000000